#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.dns_a_record_set.home: Reading...
data.dns_a_record_set.home: Read complete after 0s [id=capnduck.ddns.net]
module.acm.data.aws_route53_zone.this: Reading...
module.acm.aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:us-east-1:009727205366:certificate/8ce6a6a4-d99c-448c-b2df-8934053f664d]
module.acm.data.aws_route53_zone.this: Read complete after 0s [id=Z05346383CF9J3IH2UIOG]
module.acm.aws_route53_record.validation[1]: Refreshing state... [id=Z05346383CF9J3IH2UIOG__c39759b1b4ce68a0a58295c7c4040ee4.www.capnduck.com._CNAME]
module.acm.aws_route53_record.validation[0]: Refreshing state... [id=Z05346383CF9J3IH2UIOG__7e17ed3c254a4598e2141844c108f21c.capnduck.com._CNAME]
module.http_https_eveywhere.aws_security_group_rule.egress: Refreshing state... [id=sgrule-707140775]
aws_dynamodb_table.tfstate_lock: Refreshing state... [id=terraform-tfstate-lock]
module.http_https_eveywhere.aws_security_group_rule.tcp[0]: Refreshing state... [id=sgrule-2712767898]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-09289eb9291b2949c]
aws_kms_key.tfstate: Refreshing state... [id=2345718b-73b8-4880-bb03-238c0ab24f02]
module.http_https_everywhere.data.aws_vpc.this: Reading...
module.http_https_eveywhere.aws_security_group_rule.tcp[1]: Refreshing state... [id=sgrule-3196345934]
module.capnduck_records.data.aws_route53_zone.this[0]: Reading...
module.http_https_eveywhere.aws_security_group.this: Refreshing state... [id=sg-0388b4dac711c08af]
data.aws_vpc.this: Reading...
module.capnduck_records.data.aws_route53_zone.this[0]: Read complete after 0s [id=Z05346383CF9J3IH2UIOG]
module.jelliott_records.data.aws_route53_zone.this[0]: Reading...
module.all_from_home.data.aws_vpc.this: Reading...
module.ecs.aws_ecs_cluster.this: Refreshing state... [id=arn:aws:ecs:us-west-2:009727205366:cluster/default]
module.zones.aws_route53_zone.this["jelliott.io"]: Refreshing state... [id=Z04938253L3MEH8G7WE6R]
data.aws_route53_zone.this[0]: Reading...
aws_ecr_repository.this: Refreshing state... [id=capnduck]
data.aws_caller_identity.this: Reading...
data.aws_caller_identity.this: Read complete after 0s [id=009727205366]
aws_s3_bucket.tfstate: Refreshing state... [id=capnduck-terraform-tfstate]
module.jelliott_records.data.aws_route53_zone.this[0]: Read complete after 0s [id=Z04938253L3MEH8G7WE6R]
module.capnduck_records.aws_route53_record.this["drive CNAME"]: Refreshing state... [id=Z05346383CF9J3IH2UIOG_drive.capnduck.com_CNAME]
module.capnduck_records.aws_route53_record.this[" NS"]: Refreshing state... [id=Z05346383CF9J3IH2UIOG_capnduck.com_NS]
module.http_https_everywhere.data.aws_vpc.this: Read complete after 1s [id=vpc-09289eb9291b2949c]
module.capnduck_records.aws_route53_record.this["groups CNAME"]: Refreshing state... [id=Z05346383CF9J3IH2UIOG_groups.capnduck.com_CNAME]
data.aws_vpc.this: Read complete after 1s [id=vpc-09289eb9291b2949c]
module.capnduck_records.aws_route53_record.this[" TXT"]: Refreshing state... [id=Z05346383CF9J3IH2UIOG_capnduck.com_TXT]
module.capnduck_records.aws_route53_record.this[" CAA"]: Refreshing state... [id=Z05346383CF9J3IH2UIOG_capnduck.com_CAA]
data.aws_route53_zone.this[0]: Read complete after 1s [id=Z05346383CF9J3IH2UIOG]
module.capnduck_records.aws_route53_record.this["_dmarc TXT"]: Refreshing state... [id=Z05346383CF9J3IH2UIOG__dmarc.capnduck.com_TXT]
module.capnduck_records.aws_route53_record.this["subsonic CNAME"]: Refreshing state... [id=Z05346383CF9J3IH2UIOG_subsonic.capnduck.com_CNAME]
module.capnduck_records.aws_route53_record.this[" MX"]: Refreshing state... [id=Z05346383CF9J3IH2UIOG_capnduck.com_MX]
module.all_from_home.data.aws_vpc.this: Read complete after 1s [id=vpc-09289eb9291b2949c]
module.capnduck_records.aws_route53_record.this["calendar CNAME"]: Refreshing state... [id=Z05346383CF9J3IH2UIOG_calendar.capnduck.com_CNAME]
module.capnduck_records.aws_route53_record.this["webmail CNAME"]: Refreshing state... [id=Z05346383CF9J3IH2UIOG_webmail.capnduck.com_CNAME]
module.capnduck_records.aws_route53_record.this["mail CNAME"]: Refreshing state... [id=Z05346383CF9J3IH2UIOG_mail.capnduck.com_CNAME]
module.capnduck_records.aws_route53_record.this["sites CNAME"]: Refreshing state... [id=Z05346383CF9J3IH2UIOG_sites.capnduck.com_CNAME]
aws_kms_alias.tfstate: Refreshing state... [id=alias/terraform-state]
module.jelliott_records.aws_route53_record.this[" NS"]: Refreshing state... [id=Z04938253L3MEH8G7WE6R_jelliott.io_NS]
module.jelliott_records.aws_route53_record.this["jenkins A"]: Refreshing state... [id=Z04938253L3MEH8G7WE6R_jenkins.jelliott.io_A]
data.aws_subnets.public: Reading...
data.aws_subnets.this: Reading...
data.aws_subnets.private: Reading...
module.ecs.aws_ecs_cluster_capacity_providers.this: Refreshing state... [id=default]
aws_ecr_lifecycle_policy.this: Refreshing state... [id=capnduck]
module.all_from_home.aws_security_group.this: Refreshing state... [id=sg-0d859e28c6fb1bd67]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0b5922e4433793379]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0f6f3efb89a553c06]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0c035011e361ea452]
data.aws_subnets.public: Read complete after 0s [id=us-west-2]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-06f85801b091e2759]
data.aws_subnets.this: Read complete after 0s [id=us-west-2]
module.vpc.aws_subnet.private[3]: Refreshing state... [id=subnet-0253184dc60aaf031]
data.aws_subnets.private: Read complete after 0s [id=us-west-2]
module.vpc.aws_subnet.private[4]: Refreshing state... [id=subnet-04a38528da1dcb2ed]
module.vpc.aws_subnet.private[5]: Refreshing state... [id=subnet-06947ef14298c9e67]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-00dd8e548892facba]
module.vpc.aws_route_table.private[3]: Refreshing state... [id=rtb-087cf48ecff5bea3d]
module.vpc.aws_route_table.private[4]: Refreshing state... [id=rtb-0b177960d81a2f1b7]
module.vpc.aws_route_table.private[5]: Refreshing state... [id=rtb-027c5b9b1eb67dea9]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-067bf7d1691134086]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-09518df5801cf8b31]
module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-0d4d4b200aefd41b0]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0a5bc5ec073940dca]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0b94d7faf68936e3c]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0a284c52e2f9146f9]
aws_db_subnet_group.public: Refreshing state... [id=public]
aws_db_subnet_group.private: Refreshing state... [id=private]
module.all_from_home.aws_security_group_rule.tcp[3]: Refreshing state... [id=sgrule-2814207979]
module.all_from_home.aws_security_group_rule.tcp[4]: Refreshing state... [id=sgrule-2243982184]
module.all_from_home.aws_security_group_rule.tcp[5]: Refreshing state... [id=sgrule-3029087960]
module.all_from_home.aws_security_group_rule.tcp[7]: Refreshing state... [id=sgrule-3437537234]
module.all_from_home.aws_security_group_rule.tcp[6]: Refreshing state... [id=sgrule-400863898]
module.all_from_home.aws_security_group_rule.tcp[0]: Refreshing state... [id=sgrule-3287070106]
module.all_from_home.aws_security_group_rule.tcp[1]: Refreshing state... [id=sgrule-4022965131]
module.all_from_home.aws_security_group_rule.tcp[2]: Refreshing state... [id=sgrule-1176284589]
module.all_from_home.aws_security_group_rule.egress: Refreshing state... [id=sgrule-3062342158]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-00dd8e548892facba1080289494]
module.vpc.aws_route_table_association.private[4]: Refreshing state... [id=rtbassoc-073a8a256a9e206ac]
module.vpc.aws_route_table_association.private[5]: Refreshing state... [id=rtbassoc-0a6ea86a864cfcd34]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0b85474b5faae36af]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0bd896340bfa89863]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-09d42e8fc1a0347af]
module.vpc.aws_route_table_association.private[3]: Refreshing state... [id=rtbassoc-0872b6bcb7685165d]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0908e20c0a154e529]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0a770f077e552adef]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-08aeb7e5177ca14d3]
aws_s3_bucket_versioning.tfstate: Refreshing state... [id=capnduck-terraform-tfstate]
aws_s3_bucket_public_access_block.tfstate: Refreshing state... [id=capnduck-terraform-tfstate]
aws_s3_bucket_acl.tfstate: Refreshing state... [id=capnduck-terraform-tfstate,private]
aws_s3_bucket_server_side_encryption_configuration.tfstate: Refreshing state... [id=capnduck-terraform-tfstate]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.http_https_everywhere.aws_security_group.this will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "http and https everywhere group managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "http and https everywhere"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "Name"        = "infra"
          + "environment" = "prod"
          + "owner"       = "aws@capnduck.com"
          + "project"     = "infrastructure"
          + "terraform"   = "true"
        }
      + vpc_id                 = "vpc-09289eb9291b2949c"
    }

  # module.http_https_everywhere.aws_security_group_rule.egress will be created
  + resource "aws_security_group_rule" "egress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "All egress traffic"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.http_https_everywhere.aws_security_group_rule.tcp[0] will be created
  + resource "aws_security_group_rule" "tcp" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # module.http_https_everywhere.aws_security_group_rule.tcp[1] will be created
  + resource "aws_security_group_rule" "tcp" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.http_https_eveywhere.aws_security_group.this will be destroyed
  # (because aws_security_group.this is not in configuration)
  - resource "aws_security_group" "this" {
      - arn                    = "arn:aws:ec2:us-west-2:009727205366:security-group/sg-0388b4dac711c08af" -> null
      - description            = "http and https everywhere group managed by Terraform" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "All egress traffic"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-0388b4dac711c08af" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 80
            },
        ] -> null
      - name                   = "http and https everywhere" -> null
      - owner_id               = "009727205366" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {
          - "Name"        = "infra"
          - "environment" = "prod"
          - "owner"       = "aws@capnduck.com"
          - "project"     = "infrastructure"
          - "terraform"   = "true"
        } -> null
      - vpc_id                 = "vpc-09289eb9291b2949c" -> null
    }

  # module.http_https_eveywhere.aws_security_group_rule.egress will be destroyed
  # (because aws_security_group_rule.egress is not in configuration)
  - resource "aws_security_group_rule" "egress" {
      - cidr_blocks            = [
          - "0.0.0.0/0",
        ] -> null
      - description            = "All egress traffic" -> null
      - from_port              = 0 -> null
      - id                     = "sgrule-707140775" -> null
      - ipv6_cidr_blocks       = [] -> null
      - prefix_list_ids        = [] -> null
      - protocol               = "-1" -> null
      - security_group_id      = "sg-0388b4dac711c08af" -> null
      - security_group_rule_id = "sgr-05f2cdc0d8088b925" -> null
      - self                   = false -> null
      - to_port                = 0 -> null
      - type                   = "egress" -> null
    }

  # module.http_https_eveywhere.aws_security_group_rule.tcp[0] will be destroyed
  # (because aws_security_group_rule.tcp is not in configuration)
  - resource "aws_security_group_rule" "tcp" {
      - cidr_blocks            = [
          - "0.0.0.0/0",
        ] -> null
      - from_port              = 80 -> null
      - id                     = "sgrule-2712767898" -> null
      - ipv6_cidr_blocks       = [] -> null
      - prefix_list_ids        = [] -> null
      - protocol               = "tcp" -> null
      - security_group_id      = "sg-0388b4dac711c08af" -> null
      - security_group_rule_id = "sgr-0f5d460467e02c475" -> null
      - self                   = false -> null
      - to_port                = 80 -> null
      - type                   = "ingress" -> null
    }

  # module.http_https_eveywhere.aws_security_group_rule.tcp[1] will be destroyed
  # (because aws_security_group_rule.tcp is not in configuration)
  - resource "aws_security_group_rule" "tcp" {
      - cidr_blocks            = [
          - "0.0.0.0/0",
        ] -> null
      - from_port              = 443 -> null
      - id                     = "sgrule-3196345934" -> null
      - ipv6_cidr_blocks       = [] -> null
      - prefix_list_ids        = [] -> null
      - protocol               = "tcp" -> null
      - security_group_id      = "sg-0388b4dac711c08af" -> null
      - security_group_rule_id = "sgr-07cfa949fa148c92b" -> null
      - self                   = false -> null
      - to_port                = 443 -> null
      - type                   = "ingress" -> null
    }

Plan: 4 to add, 0 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @CapnDucks, Action: `pull_request`*